Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_2.tmx
Source language: de
Languages: en

source: Zytofluorometrische Geräte
en: Cytofluorometric apparatus

source: Stützbandagen für medizinische Zwecke
en: Support bandages for medical purposes

source: Zahnärztliche Spiegel
en: Mirrors for dentists

source: Röntgenschirme für medizinische Zwecke
en: Radiology screens for medical purposes

source: Schienen zur Anwendung am menschlichen Körper
en: Braces for application to the human body

source: Brustpumpen für stillende Mütter
en: Breast pumps for use by nursing mothers

source: Künstliche orthopädische Implantate
en: Artificial orthopaedic implants

source: Apparate für die Diagnose neurologischer Erkrankungen
en: Apparatus for the diagnosis of neurological diseases

source: Apparate zur Verhütung von Druckbeschwerden
en: Apparatus for the prevention of pressure sores

source: Apparate für die Behandlung von Prostataerkrankungen
en: Apparatus for the treatment of disease of the prostate

source: Geräte für veterinärmedizinische Zwecke
en: Apparatus for veterinary purposes

source: Künstliche Augen
en: Artificial eyes

source: Schutzvisiere für medizinische Zwecke
en: Protective visors for medical use

source: Distraktoren [medizinische Apparate]
en: Tractions [medical apparatus]

source: Transkutane elektrische Muskelstimulatoren
en: Transcutaneous electrical muscle stimulators

source: Transkutane elektrische Nervenstimulierungselektroden
en: Transcutaneous electrical nerve stimulation electrodes

source: Transkutane elektrische Nervenstimulatoren
en: Transcutaneous electrical nerve stimulators

source: Kompressoren [Chirurgie]
en: Compressors [surgical]

source: Spezialkoffer für medizinische Instrumente
en: Cases fitted for medical instruments

source: Drainagebeutel für Wunden
en: Wound drainage pouches

source: Armbänder für medizinische Zwecke
en: Wrist braces for medical use

source: Analyseapparate für regelmäßige Körpersignale
en: Apparatus for analysing measured physical signals

source: Geräte zum Zerstören von Subkutannadeln [speziell für medizinische Zwecke]
en: Apparatus for destroying hypodermic needles [specifically adapted for medical use]

source: Künstliche Linsen für die chirurgische Implantation
en: Lenses [intraocular prostheses] for surgical implantation

source: Aufblasbare Matratzen für orthopädische Zwecke
en: Inflatable mattresses for orthopaedic purposes

source: Infrarotstrahler fÃ¼r chirurgische Zwecke
en: Infrared lamps for surgical purposes

source: Inhalationsgeräte für die Verdampfung von aromatherapeutischen Substanzen
en: Inhalers for the evaporation of aromatherapeutical substances

source: Periodontale Irrigatoren zur Verwendung in der Zahnbehandlung
en: Periodontal irrigators for use in dental treatment

source: Dauermagnete für medizinische Zwecke
en: Permanent magnets for medical use

source: Tropfenzählfläschchen für medizinische Zwecke
en: Dropper bottles for medical purposes

source: Diagnoseinstrumente für die Ophthalmologie
en: Diagnostic instruments for ophthalmology

source: Heftgeräte für chirurgische Zwecke
en: Stapling presses for surgical use

source: Implantate für die Knochenchirurgie [Prothesen]
en: Implants [prosthesis] for bone surgery

source: Polyurethanschaumbandagen [für Stützzwecke]
en: Polyurethane foam bandage [supportive]

source: Tragbare Instrumente für medizinische Zwecke zur Überwachung des Sauerstoffgehalts in Gasmischungen
en: Portable instruments for medical use in monitoring oxygen levels in gaseous mixtures

source: Ozonüberwachungsgeräte für die Ozontherapie
en: Ozone monitors for use in administering ozone therapy

source: Mineralstoffdetektoren zur Messung des Mineralstoffgehalts von Knochen am lebenden Objekt
en: Bone mineral detectors for the in-vivo measurement of bone mineral content

source: Kompressionsschrauben in Form von orthopädischen chirurgischen Implantaten
en: Compressing screws in the nature of orthopaedic surgical implants

source: Sessel für medizinische oder zahnärztliche Zwecke
en: Armchairs for medical or dental purposes

source: Elektronische Kohlendioxidschreiber für medizinische Zwecke
en: Electronic carbon dioxide recorders used for medical purposes

source: Kardiografische Instrumente
en: Cardiographic instruments

source: Kardiovaskuläre Nadeln
en: Cardiovascular needles

source: Becken für medizinische Zwecke
en: Basins for medical purposes

source: Elastische Schlauchbandagen zum Stützen von Gelenken
en: Tubular elastic bandages for supporting joints

source: Zahnärztliche Röntgengeräte
en: Dental x-ray apparatus

source: Wärmebehälter zur Linderung von Muskelschmerzen
en: Heat dispensing containers for relieving muscle pain

source: Krebsbestrahlungsgeräte für medizinische Zwecke
en: Radiation oncology apparatus for medical use

source: Heftklammern für chirurgische Zwecke
en: Staplers for surgical purposes

source: Zellzähler für medizinische Zwecke
en: Cell counting units for medical use

source: Magnetfeldgeneratoren für medizinische Zwecke
en: Magnetic field generators for medical use

source: Magnetische Behandlungsapparate für medizinische Zwecke
en: Magnetic treatment apparatus for medical use

source: Endoskopische Geräte
en: Endoscopic apparatus

source: Schirme für medizinische Instrumente
en: Shields for medical instruments

source: Schulterstützen für medizinische Zwecke
en: Shoulder supports for medical use

source: Elektrische Nervenstimulatoren
en: Electrical nerve stimulators

source: Subkutane Injektionsapparate
en: Hypodermic injection apparatus

source: Röhrchen für Blutabnahmen
en: Blood collecting tubules

source: Orthopädische Stützen für Fersen
en: Orthopaedic supports for heels

source: Orthopädische Gelenkimplantatprothesen
en: Orthopedic joint implant prostheses

source: Probenahmegeräte für medizinische Zwecke
en: Specimen samplers for medical use

source: Orthopädische Binden
en: Orthopaedic bandages

source: Medizinische Apparate für die Feststellung von Kohlendioxid in den Atemwegen
en: Medical apparatus for detecting carbon dioxide in the airways

source: Medizinische Instrumente zum Testen auf Infektionskrankheiten
en: Medical instruments for infectious disease testing

source: Medizinische Instrumente zur Wiedergabe physiologischer Daten
en: Medical instruments for reproducing physiological data

source: Medizinische Geräte zur Verwendung als Hörhilfen
en: Medical instruments for use as aids to hearing

source: Einweglanzetten für die Fingerpunktur
en: Disposable lancets for finger puncture

source: Einwegdüsen für zahnärztliche Spritzen
en: Disposable nozzles for dental syringes

source: Untersuchungsstühle für zahnmedizinische Zwecke
en: Examination chairs specially made for dental use

source: Elektroden aus Glas für medizinische Zwecke
en: Electrodes for medical use made from glass

source: Elektromagnetische medizinische Geräte
en: Electromagnetic medical apparatus

source: Elektronische Akupunkturgeräte
en: Electronic acupuncture instruments

source: Gammakameras für medizinische Zwecke
en: Gamma cameras for medical purposes

source: Beutel für die endoskopische Entnahme von Gewebe
en: Bags for endoscopic retrieval of tissue

source: Heparinsteuerungsapparate für chirurgische Verfahren
en: Heparin control apparatus for surgical procedures

source: Prothesen für chirurgische Behandlungen
en: Prostheses for surgical treatment

source: Prothetische Hüftgelenkimplantate
en: Prosthetic hip joint implants

source: Elektroden für Herzdefibrillatoren
en: Cardiac defibrillation electrodes

source: Kornzangen [für chirurgische Zwecke]
en: Dressing forceps [for surgical use]

source: Faseroptische Temperaturprüfsonden für medizinisch-diagnostische Zwecke
en: Optical fibre temperature probes for medical diagnostic use

source: Trennsäulen für medizinische Zwecke für die Gaschromatografie
en: Separation columns for medical use in gas chromatography

source: Führungsdrähte für Ballondilatationskatheter
en: Guide wires for use with balloon dilatation catheters

source: Elektromedizinische Geräte
en: Electro medical instruments

source: Medizinische Lüfter
en: Medical ventilators

source: MRT-Geräte für Diagnosezwecke
en: MRI diagnostic apparatus

source: Intravenöse Beutel für chirurgische Zwecke
en: Intravenous bags for surgical purposes

source: Lanziergeräte für chirurgische Zwecke
en: Lancing devices for surgical use

source: Medizinische Instrumente für die Dilatationstracheometrie
en: Medical instruments for percutaneous tracheostomy

source: Wärmebehälter zur Linderung von Ohrenschmerzen
en: Heat dispensing containers for relieving pain in the ear

source: Wärmetausch-Bakterienfilter für medizinische Zwecke
en: Heat exchange anti-bacterial filters for medical use

source: Befeuchter zur Verwendung mit Atemtherapiegeräten
en: Humidifiers for use with respiratory therapy apparatus

source: Schienen für medizinische Zwecke
en: Splinting materials for medical use

source: Angiographische vaskuläre Inserter zum Platzieren von Kathetern
en: Angiographic vascular introducers for the placement of catheters

source: Masken für die Herz-Lungen-Wiederbelebung
en: Cardiopulmonary resuscitation masks

source: Biokompatible beschichtete Stents
en: Biocompatible coated stents

source: Fingerlinge für medizinische Zwecke
en: Finger guards for medical purposes

source: Stromtherapieinstrumente für Straffungsbehandlungen
en: Electrotherapy instruments for firming treatments

source: Gipsbinden für orthopädische Zwecke
en: Plaster bandages for orthopaedic purposes

source: Beißringe zur Schmerzlinderung beim Zahnen
en: Teething rings for relieving teething pain

source: Reißverschlüsse als temporärer Wundverschluss
en: Zippers adapted for use as temporary wound closures

source: Urologische Apparate und Instrumente
en: Urological apparatus and instruments

source: Programmierbare Hörgeräte
en: Programmable hearing aids

source: Kompressoren für medizinische Behandlungszwecke
en: Compressors for medical [treatment] purposes

source: Medizinische Unterleibspolster
en: Abdominal pads for medical use

source: Medizinische Decken zum Wärmen von Patienten
en: Medical blankets for the warming of patients

source: Medizinische Kompressionsstrümpfe
en: Medical compression stockings

source: Optomedizinische Untersuchungsinstrumente
en: Optomedical examination instruments

source: Lampen für medizinische Heilzwecke
en: Lamps for medical [curative] purposes

source: Apparate für die medizinische Rehabilitation
en: Apparatus for medical rehabilitation

source: Geräte zur Nervenstimulierung
en: Apparatus for nerve stimulation

source: Apparate für die Linderung von Atembeschwerden
en: Apparatus for the alleviation of breathing difficulties

source: Atemschutzmasken für medizinische Anwendungen
en: Protective breathing masks for medical applications

source: Zeitprogrammierbare intravenöse Perfusionspumpen
en: Time programmable intravenous perfusion pumps

source: Zeheneinsätze für Schuhwaren [orthopädisch]
en: Toe inserts for footwear [orthopaedic]

source: Zehentrenner für orthopädische Zwecke
en: Toe separators for orthopaedic purposes

source: Senkfußeinlagen für orthopädische Schuhe
en: Arch supports for orthopaedic shoes

source: Künstliche Knochen
en: Artificial bones

source: Physiologische Messapparate für medizinische Zwecke
en: Physiological measuring apparatus for medical use

source: Rohre für medizinische Anwendungen
en: Pipes for medical applications

source: Platten in Form von orthopädischen chirurgischen Implantaten
en: Plates in the nature of orthopaedic surgical implants

source: Spezialbetten für die medizinische Versorgung
en: Beds specially made for medical purposes

source: Inkubatoren für Säuglinge
en: Incubators for babies

source: Massagegeräte für den persönlichen Gebrauch
en: Massaging apparatus for personal use

source: Urinuntersuchungsapparate für medizinische Diagnosezwecke
en: Urine testing instruments for medical diagnostic purposes

source: Implantate zur Verwendung in der Kieferchirurgie [Prothesen]
en: Implants [prosthesis] for use in jawbone surgery

source: Implantate zur Verwendung in Sehnen [Prothesen]
en: Implants [prosthesis] for use in tendons

source: Stützbekleidung für medizinische Zwecke
en: Support garments for medical use

source: Anatomische Stützbandagen
en: Supportive anatomical bandages

source: Chromatografieplatten für medizinische Zwecke
en: Chromatography plates for medical use

source: CO2-Insufflatoren für die endoskopische Therapie
en: Co2 insufflators for endoscopic therapy

source: Co2-Irrigatoren für die urologische Diagnose
en: Co2 irrigators for urological diagnosis

source: Messgeräte zum Messen von Blutzucker
en: Meters for measuring blood glucose

source: Knochenimplantate aus künstlichen Materialien
en: Bone implants composed of artificial materials

source: Steuergeräte für Herzarrhythmie
en: Cardiac arrhythmia control devices

source: Schlingen [stützende Bandagen]
en: Slings [supporting bandages]

source: Künstliche Körperteile
en: Artificial parts for the body

source: Asymmetrische Stangen für Körperübungen [angepasst für medizinische Zwecke]
en: Asymmetrical bars for physical exercise [adapted for medical use]

source: Apparate für die Stimulation von Akupunkturpunkten
en: Apparatus for the stimulation of acupuncture points

source: Apparate zum Testen von Hörstörungen
en: Apparatus for use in testing hearing disorders

source: Apparate für die Anfertigung von Zahnprothesen
en: Apparatus for use in the preparation of dental prostheses

source: Applikationsgeräte für antiseptische Präparate
en: Applicators for antiseptic preparations

source: Harnflaschen für medizinische Zwecke
en: Urinals for medical purposes [vessels]

source: Schutzmasken für Chirurgen zur Verwendung bei Operationen
en: Protective masks for use by surgeons during operations

source: Organische Spurenkonzentrierungsgeräte für medizinische Diagnosezwecke
en: Trace organic concentrators for medical use in diagnosis

source: Röntgenröhren für medizinische Zwecke
en: X-ray tubes for medical purposes

source: Sägen für chirurgische Zwecke
en: Saws for surgical purposes

source: Gewichtstrainingsgeräte für medizinische Zwecke
en: Weight training apparatus adapted for medical use

source: Röntgenfilmrahmen für chirurgische Zwecke
en: X-ray film frames for surgical use

source: Elektrische zahnärztliche Geräte
en: Dental apparatus, electric

source: Medizinische Geräte aus Naturgummi zur Präventivbehandlung
en: Contrivances made from natural rubber for prophylactic purposes

source: Operationsbesteck für die Wirbelsäulenchirurgie
en: Surgical instruments for use in spinal surgery

source: Otologische Prothesen
en: Otological prostheses

source: Farbpyrometer für medizinische Zwecke
en: Colour pyrometers for medical use

source: Kompressionsbandagen [elastisch oder stützend]
en: Compression bandages [elastic or supportive]

source: Orthopädische Geräte aus Silikon
en: Silicone orthopedic devices

source: Hauttemperaturanzeiger für medizinische Zwecke
en: Skin temperature indicators for medical use

source: Nadeln für medizinische Zwecke
en: Needles for medical purposes

source: Chiropraktische Instrumente
en: Chiropractic instruments

source: Elektronische Apparate für medizinische Zwecke
en: Electronic apparatus for medical purposes

source: Kardiovaskuläre Pumpen
en: Cardiovascular pumps

source: Bandagiermaterial [elastisch]
en: Materials for bandaging [elasticated]

source: Geräte für die Herzdefibrillation
en: Apparatus for cardiac defibrillation

source: Geräte [Mundduschen] zur Verwendung durch Zahnärzte beim Spülen des Zahnfleischs
en: Devices [oral irrigators] for use by dentists in washing the gums

source: Abbildende Magnetresonanz-Spektrometer für medizinische Zwecke
en: Magnetic resonance imaging spectrometers for medical use

source: Schuheinlagen für orthopädische Zwecke
en: Shoe insoles for orthopedic use

source: Shunts zur Verwendung im Blutkreislauf
en: Shunts for use in the blood circulatory system

source: Saugflaschen
en: Feeding bottles

source: Saugflaschen für Babys
en: Feeding bottles for babies

source: Subkutane Nadeln für Injektionen
en: Hypodermic needles for injection

source: Subkutane Nadeln für die Wunddrainage
en: Hypodermic needles for use in wound drainage

source: Eisbeutel für die Behandlung von Verletzungen
en: Ice packs for the treatment of injuries

source: Biotherapeutische Gesichtsmasken
en: Bio therapeutic facial masks

source: Spinalimplantate aus künstlichen Materialien
en: Spinal implants composed of artificial material

source: Verbände für medizinische oder chirurgische Zwecke
en: Plaster for medical or surgical purposes

source: Orthopädische Bandagen
en: Orthopaedic strappings

source: Orthopädische Implantate
en: Orthopaedic implants

source: Spezialmöbel für medizinische Zwecke
en: Furniture especially made for medical purposes

source: Endstücke für Krücken
en: Tips for crutches

source: Zentralmedulläre Nägel
en: Centro-medullary nails

source: Hafttücher für chirurgische Zwecke
en: Adhesive drapes for surgical use

source: Aufblasbare Bekleidungsstücke für medizinische Zwecke
en: Air inflatable garments for medical purposes

source: Messlöffel zur Verabreichung von Arzneimitteln
en: Measuring spoons for administering medicine

source: Medizinische Instrumente für Tierkörper
en: Medical instruments for application on animal bodies

source: Medizinische Instrumente zur Aufzeichnung physiologischer Daten
en: Medical instruments for recording physiological data

source: Subkutane Einwegspritzen für chirurgische Zwecke
en: Disposable hypodermic syringes for surgical use

source: Einwegschutzhandschuhe für medizinische Zwecke
en: Disposable protective gloves for medical purposes

source: Abdecktücher aus saugfähiger Zellstoffwatte zur Verwendung bei Operationen
en: Drape sheets of absorbent cellulose wadding for use during surgery

source: Übungsgeräte für die medizinische Rehabilitation
en: Exercising apparatus for medical rehabilitative purposes

source: Trainingsstiefel für medizinische Rehabilitationszwecke
en: Exercise boots for medical rehabilitative purposes

source: Rückhaltegurte zum Sichern von Patienten auf Krankentragen
en: Retaining belts for restraining patients on stretchers

source: Elektroden zur Erfassung von biologischen Parametern
en: Electrodes for picking up biological parameters

source: Elektroden zur Aufnahme von elektrophysiologischer Parameter
en: Electrodes for picking up electrophysiological parameters

source: Therapeutische Geräte mit elektromagnetischen Wellen
en: Electromagnetic wave therapeutic instruments

source: Thermoelektrische Kompressen
en: Thermo-electric compresses

source: Intraokulare Implantate
en: Intra-ocular implants

source: Laser für ophthalmische Zwecke
en: Lasers for ophthalmic purposes

source: Medizinische Beutel zum Sammeln von Urinproben
en: Bags for medical use in collecting urine samples

source: Medizinische Beutel für die Aufbewahrung von Urinproben
en: Bags for medical use in storing urine samples

source: Hochfrequenzgeneratoren für medizinische Behandlungen
en: High frequency generators for use in medical treatment

source: Prothetische Geräte für zahnmedizinische Zwecke
en: Prosthetic instruments for dental purposes

source: Prothetische Bänder
en: Prosthetic ligaments

source: Ultraschallsonden für medizinische Zwecke
en: Ultrasonic probes for medical use

source: Prothesen in Form einer Vollkronenerneuerung
en: Prostheses in the form of full crown restorations

source: Infrarotstrahler fÃ¼r therapeutische Zwecke
en: Infrared radiator units for therapeutic purposes

source: Düsen für zahnärztliche Spritzen
en: Nozzles for dental syringes

source: Echtzeitfilter als Teile von Röntgenkameras für medizinische Zwecke
en: Real time filters being parts of x-ray cameras for medical use

source: Scanner für medizinische Diagnosen
en: Scanners for medical diagnosis

source: Scheren [chirurgische Instrumente]
en: Shears [surgical instruments]

source: Elastische Kompressionsverbände für medizinische Zwecke
en: Elastic compression bandages for medical purposes

source: Elastische Bandagen für Stützzwecke
en: Elasticated bandages for supportive use

source: Elastische Ellenbogenstützen
en: Elasticated supports for the elbow

source: Gynäkologische Geräte
en: Gynaecological instruments

source: Dehnbare Bänder zur Einführung in röhrenförmige Organe des Körpers zur Behandlung von Stenose
en: Expandable braids for insertion in tubular organs of the body for the treatment of stenosis

source: Medizinische Geräte mit eingebautem Laser
en: Medical instruments incorporating lasers

source: Medizinische Stethoskope
en: Medical stethoscopes

source: Endoskope für therapeutische Zwecke
en: Endoscopes for therapeutic use

source: Medizinische Untersuchungslaken
en: Medical examination sheets

source: Vernebelungsgeräte für die Atemtherapie
en: Nebulizers for respiration therapy

source: Medizinische Apparate zum Messen des Sauerstoffgehalts des Bluts
en: Medical apparatus for measuring the oxygen content of blood

source: Medizinische Apparate zur Anzeige tomographischer Daten
en: Medical apparatus for the display of tomographic data

source: Medizinische Apparate zum Trainieren von Atemtechniken
en: Medical apparatus for training breathing techniques

source: Medizinische Bestrahlungsgeräte
en: Medical radiation apparatus

source: Bandagen für orthopädische Zwecke
en: Bandages for orthopaedic purposes

source: Instrumente zum Einfüllen von Zahnfüllungen
en: Instruments for applying dental filling

source: Instrumente für das Abbinden von Hämorrhoiden mit Gummiband
en: Instruments for rubber band ligation of haemorrhoids

source: Lampen zur Verwendung mit Zahninstrumenten
en: Lamps for use with dental instruments

source: Laseranlagen für medizinische Zwecke
en: Laser installations for medical use

source: Subkutane Ventile als Implantate
en: Subcutaneous valves for implantation

source: Geräte zur Erhaltung körperlicher Fitness [für medizinische Zwecke]
en: Apparatus for achieving physical fitness [for medical use]

source: Inhalationsgeräte zur Verabreichung von Arzneimitteln
en: Apparatus for administering drugs by inhalation

source: Apparate zur Analyse von Hirnwellenfrequenzen
en: Apparatus for analysing brain wave frequencies

source: Schnuller für Säuglinge
en: Dummies [teats] for babies

source: Diagnosekatheter für die Elektrophysiologie
en: Electrophysiology diagnostic catheters

source: Chemilumineszenzleuchten für endoskopische Untersuchungen
en: Chemiluminescent light for use in endoscopic exams

source: Medizinische Probenbecher
en: Medical specimen cups

source: Röntgenstrukturanalyseinstrumente für medizinische Zwecke
en: X-ray structure analysis instruments for medical use

source: Apparate für die Behandlung von Lymphödemen
en: Apparatus for the treatment of lymphoedema

source: Elektrische Zerstäuber für medizinische Zwecke
en: Power operated sprayers for medical purposes

source: Entwicklungsgeräte für lichtempfindliche Filme für medizinische Zwecke
en: Processors for photosensitive films [for medical purposes]

source: Computergesteuerte Trainingsgeräte für therapeutische Zwecke
en: Computer controlled training apparatus for therapeutic use

source: Kondome für medizinische Zwecke
en: Condoms for medical purposes

source: Profilkissen für Patienten in Betten [angepasst für medizinische Zwecke]
en: Contoured cushions for patients' use on beds [adapted for medical purposes]

source: Katheter
en: Catheters

source: Orthopädische Klammern
en: Orthopaedic braces

source: Damenstrümpfe [chirurgisch]
en: Ladies' stockings [surgical]

source: Spongiosaschrauben in Form von orthopädischen chirurgischen Implantaten
en: Lag screws in the nature of orthopaedic surgical implants

source: Apparate zur Nervenlokalisierung
en: Apparatus for nerve location
